ЦентраАдминистрированияСервер/src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресАгентаСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортАгентаСервера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/Кластеры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КластерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияПлатформы) Тогда
		ВерсияПлатформы = РаботаСПодключениямиCOM.ВерсияПлатформы();
	Иначе
		ВерсияПлатформы = Объект.ВерсияПлатформы;
	КонецЕсли;
	
	КластерыМассив = РаботаСПодключениямиCOM.ПолучитьКластеры(
		СокрЛП(Объект.АдресАгентаСервера),
		СокрЛП(Объект.ПортАгентаСервера),
		ВерсияПлатформы);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Кластер Из КластерыМассив Цикл
		ДанныеВыбора.Добавить(Кластер, Кластер.ClusterName);
	КонецЦикла;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КластерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИмяКластера = ВыбранноеЗначение.ClusterName;
	ХостКластера =  ВыбранноеЗначение.HostName;
	ПортКластера = СтрЗаменить(Строка(ВыбранноеЗначение.Mainport)," ","");
	
	Объект.ПортКластера = ПортКластера;
	Объект.Кластер = ИмяКластера;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ХостКластера + ":" + ПортКластера;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
